eisup_2019_docmng_integration/src/Reports/ЧисленностьРаботающихИЗабронированныхГражданЗапаса/ЧисленностьРаботающихИЗабронированныхГражданЗапаса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ЧисленностьРаботающихИЗабронированныхГражданЗапаса</name>
  <attributes>
    <name>РасширеннаяНастройка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтрицательноеКрасным</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначенияНастроекПанелиПользователя</name>
  </attributes>
  <attributes>
    <name>ПараметрыПанелиПользователя</name>
  </attributes>
  <attributes>
    <name>ПредставлениеЭлементаОтчета</name>
    <type>
      <types>EnumRef.ПредставленияЭлементовОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Расшифровки</name>
  </attributes>
</mdclass:Report>

eisup_2019_docmng_integration/src/Enums/ОтношениеКВоинскойОбязанности/ОтношениеКВоинскойОбязанности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОтношениеКВоинскойОбязанности</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>Военнообязанный</name>
  </enumValues>
  <enumValues>
    <name>НеВоеннообязанный</name>
  </enumValues>
  <enumValues>
    <name>Призывник</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/КатегорииДолжностейДляВоинскогоУчета/КатегорииДолжностейДляВоинскогоУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КатегорииДолжностейДляВоинскогоУчета</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>Руководители</name>
  </enumValues>
  <enumValues>
    <name>СпециалистыСХ</name>
  </enumValues>
  <enumValues>
    <name>СпециалистыТорговлиИОбщепита</name>
  </enumValues>
  <enumValues>
    <name>СпециалистыНауки</name>
  </enumValues>
  <enumValues>
    <name>СпециалистыКультуры</name>
  </enumValues>
  <enumValues>
    <name>СпециалистыОбразования</name>
  </enumValues>
  <enumValues>
    <name>Врачи</name>
  </enumValues>
  <enumValues>
    <name>СреднийМедицинскийПерсонал</name>
  </enumValues>
  <enumValues>
    <name>ДругиеСлужащие</name>
  </enumValues>
  <enumValues>
    <name>Рабочие1_2Разрядов</name>
  </enumValues>
  <enumValues>
    <name>Рабочие3_4Разрядов</name>
  </enumValues>
  <enumValues>
    <name>Рабочие5РазрядаИВыше</name>
  </enumValues>
  <enumValues>
    <name>РабочиеНеИмеющиеТарифныхСтавок</name>
  </enumValues>
  <enumValues>
    <name>РабочиеСХ</name>
  </enumValues>
  <enumValues>
    <name>РабочиеЛокомотивныхБригад</name>
  </enumValues>
  <enumValues>
    <name>Водители</name>
  </enumValues>
  <enumValues>
    <name>Трактористы</name>
  </enumValues>
  <enumValues>
    <name>Учащиеся</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеСпециалисты</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРабочие</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/ГодностьКВоеннойСлужбе/ГодностьКВоеннойСлужбе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ГодностьКВоеннойСлужбе</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>Годен</name>
  </enumValues>
  <enumValues>
    <name>ГоденСОграничениями</name>
  </enumValues>
  <enumValues>
    <name>ОграниченноГоден</name>
  </enumValues>
  <enumValues>
    <name>ВременноНеГоден</name>
  </enumValues>
  <enumValues>
    <name>НеГоден</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Catalogs/ЗваниеГражданскогоВоинскогоУчета/ЗваниеГражданскогоВоинскогоУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЗваниеГражданскогоВоинскогоУчета</name>
  <comment>(Регл)</comment>
  <predefined>
    <items>
      <name>ГенералАрмии</name>
      <description>Генерал армии</description>
    </items>
    <items>
      <name>ГенералЛейтенант</name>
      <description>Генерал-лейтенант</description>
    </items>
    <items>
      <name>ГенералМайор</name>
      <description>Генерал-майор</description>
    </items>
    <items>
      <name>ГенералПолковник</name>
      <description>Генерал-полковник</description>
    </items>
    <items>
      <name>Ефрейтор</name>
      <description>Ефрейтор</description>
    </items>
    <items>
      <name>Капитан</name>
      <description>Капитан</description>
    </items>
    <items>
      <name>Лейтенант</name>
      <description>Лейтенант</description>
    </items>
    <items>
      <name>Майор</name>
      <description>Майор</description>
    </items>
    <items>
      <name>МаршалРоссийскойФедерации</name>
      <description>Маршал Российской Федерации</description>
    </items>
    <items>
      <name>МладшийЛейтенант</name>
      <description>Младший лейтенант</description>
    </items>
    <items>
      <name>МладшийСержант</name>
      <description>Младший сержант</description>
    </items>
    <items>
      <name>Подполковник</name>
      <description>Подполковник</description>
    </items>
    <items>
      <name>Полковник</name>
      <description>Полковник</description>
    </items>
    <items>
      <name>Прапорщик</name>
      <description>Прапорщик</description>
    </items>
    <items>
      <name>Рядовой</name>
      <description>Рядовой</description>
    </items>
    <items>
      <name>Сержант</name>
      <description>Сержант</description>
    </items>
    <items>
      <name>СтаршийЛейтенант</name>
      <description>Старший лейтенант</description>
    </items>
    <items>
      <name>СтаршийПрапорщик</name>
      <description>Старший прапорщик</description>
    </items>
    <items>
      <name>СтаршийСержант</name>
      <description>Старший сержант</description>
    </items>
    <items>
      <name>Старшина</name>
      <description>Старшина</description>
    </items>
  </predefined>
  <attributes>
    <name>ОбщевойсковоеЗвание</name>
    <type>
      <types>CatalogRef.ЗваниеГражданскогоВоинскогоУчета</types>
    </type>
  </attributes>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Reports/ЧисленностьРаботающихИЗабронированныхГражданЗапаса/ObjectModule.bsl
Перем СохраненнаяНастройка Экспорт;        // Текущий вариант отчета

Перем ТаблицаВариантовОтчета Экспорт;      // Таблица вариантов доступных текущему пользователю

// Добавляет строку в таблицу ТДанных
Процедура ОписаниеСтрокиДанных(ТДанных, НомерСтрокиОтчета, Порядок, ИмяСтрокиОтчета, Категория)
	
	Строка = ТДанных.Добавить();
	Строка.НомерСтрокиОтчета = НомерСтрокиОтчета;
	Строка.Порядок = Порядок;
	Строка.ИмяСтрокиОтчета = ИмяСтрокиОтчета;
	Строка.Категория = Категория;

КонецПроцедуры
	
Функция СформироватьОтчет(Результат = Неопределено, ДанныеРасшифровки = Неопределено, ВыводВФормуОтчета = Истина) Экспорт
	
	ЗначениеПанелипользователя = ТиповыеОтчеты.ПолучитьЗначенияНастроекПанелиПользователяОбъекта(ЭтотОбъект);
	НастрокаПоУмолчанию        = КомпоновщикНастроек.ПолучитьНастройки();
	ТиповыеОтчеты.ПолучитьПримененуюНастройку(ЭтотОбъект);
	
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "Военнообязанный", Перечисления.ОтношениеКВоинскойОбязанности.Военнообязанный);
	
	Если ЗначениеПанелипользователя <> Неопределено тогда
		ЗначениеПанелипользователя.ВыводитьЗаголовокОтчета = ложь;
		ЗначенияНастроекПанелиПользователя = Новый ХранилищеЗначения(ЗначениеПанелипользователя);
	КонецЕсли;
	
	ЭлементСтруктуры = Неопределено;
	
	Если КомпоновщикНастроек.Настройки.Структура.Количество()=1 тогда
		ЭлементСтруктуры = КомпоновщикНастроек.Настройки.Структура[0];
	ИначеЕсли КомпоновщикНастроек.Настройки.Структура.Количество()> 1 Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если ЭлементСтруктуры <> Неопределено И ТипЗнч(ЭлементСтруктуры) <> Тип("ГруппировкаКомпоновкиДанных") тогда
		 Возврат Результат;
	КонецЕсли;
	
	
	МассивГруппировок = ТиповыеОтчеты.ПолучитьЭлементыСтруктуры(КомпоновщикНастроек);
	Для Каждого Группировка из МассивГруппировок Цикл
		Параметр = Группировка.Значение.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("TemplateType"));
		Параметр.Значение = ТипМакетаГруппировкиКомпоновкиДанных.Вертикальный;
		Параметр.Использование = истина;
	КонецЦикла;
	
	ТиповыеОтчеты.ДобавитьГруппировку(КомпоновщикНастроек, "Организация");
	
	ТиповыеОтчеты.ДобавитьГруппировку(КомпоновщикНастроек, "Порядок");
	
	
	СписокОфицерскихЗваний	=	Новый СписокЗначений;
	СписокОфицерскихЗваний.Добавить(Справочники.ЗваниеГражданскогоВоинскогоУчета.МладшийЛейтенант);
	СписокОфицерскихЗваний.Добавить(Справочники.ЗваниеГражданскогоВоинскогоУчета.Лейтенант);
	СписокОфицерскихЗваний.Добавить(Справочники.ЗваниеГражданскогоВоинскогоУчета.СтаршийЛейтенант);
	СписокОфицерскихЗваний.Добавить(Справочники.ЗваниеГражданскогоВоинскогоУчета.Капитан);
	СписокОфицерскихЗваний.Добавить(Справочники.ЗваниеГражданскогоВоинскогоУчета.Майор);
	СписокОфицерскихЗваний.Добавить(Справочники.ЗваниеГражданскогоВоинскогоУчета.Подполковник);
	СписокОфицерскихЗваний.Добавить(Справочники.ЗваниеГражданскогоВоинскогоУчета.Полковник);
	СписокОфицерскихЗваний.Добавить(Справочники.ЗваниеГражданскогоВоинскогоУчета.ГенералМайор);
	СписокОфицерскихЗваний.Добавить(Справочники.ЗваниеГражданскогоВоинскогоУчета.ГенералЛейтенант);
	СписокОфицерскихЗваний.Добавить(Справочники.ЗваниеГражданскогоВоинскогоУчета.ГенералПолковник);
	СписокОфицерскихЗваний.Добавить(Справочники.ЗваниеГражданскогоВоинскогоУчета.ГенералАрмии);
	СписокОфицерскихЗваний.Добавить(Справочники.ЗваниеГражданскогоВоинскогоУчета.МаршалРоссийскойФедерации);
	
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "Офицеры", СписокОфицерскихЗваний);
	
	СписокЗванийПрапорщиков	=	Новый СписокЗначений;
	СписокЗванийПрапорщиков.Добавить(Справочники.ЗваниеГражданскогоВоинскогоУчета.Прапорщик);
	СписокЗванийПрапорщиков.Добавить(Справочники.ЗваниеГражданскогоВоинскогоУчета.СтаршийПрапорщик);
	СписокЗванийПрапорщиков.Добавить(Справочники.ЗваниеГражданскогоВоинскогоУчета.МладшийСержант);
	СписокЗванийПрапорщиков.Добавить(Справочники.ЗваниеГражданскогоВоинскогоУчета.Сержант);
	СписокЗванийПрапорщиков.Добавить(Справочники.ЗваниеГражданскогоВоинскогоУчета.СтаршийСержант);
	СписокЗванийПрапорщиков.Добавить(Справочники.ЗваниеГражданскогоВоинскогоУчета.Старшина);
	
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "Прапорщики", СписокЗванийПрапорщиков);
	
	СписокСолдатскихЗваний	=	Новый СписокЗначений;
	СписокСолдатскихЗваний.Добавить(Справочники.ЗваниеГражданскогоВоинскогоУчета.Рядовой);
	СписокСолдатскихЗваний.Добавить(Справочники.ЗваниеГражданскогоВоинскогоУчета.Ефрейтор);
	
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "Призывник", Перечисления.ОтношениеКВоинскойОбязанности.Призывник);
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "ПустаяКатегорияВоинскогоУчета", Перечисления.КатегорииДолжностейДляВоинскогоУчета.ПустаяСсылка());
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "Солдаты", СписокСолдатскихЗваний);
	
	СписокГодныеКСлужбе = Новый СписокЗначений;
	//СписокГодныеКСлужбе.Добавить(Перечисления.ГодностьКВоеннойСлужбе.Годен);
	СписокГодныеКСлужбе.Добавить(Перечисления.ГодностьКВоеннойСлужбе.ГоденСОграничениями);
	СписокГодныеКСлужбе.Добавить(Перечисления.ГодностьКВоеннойСлужбе.ВременноНеГоден);	
	
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "СписокГодныеКСлужбе", СписокГодныеКСлужбе);
	//
	//Запрос.УстановитьПараметр("ДатаАктуальности",	ДатаАктуальности);
	//Запрос.УстановитьПараметр("Организация",		Организация);
	//Запрос.УстановитьПараметр("ГоловнаяОрганизация",ОбщегоНазначения.ГоловнаяОрганизация(Организация));
	//Запрос.УстановитьПараметр("Офицеры",			СписокОфицерскихЗваний);
	//Запрос.УстановитьПараметр("Прапорщики",			СписокЗванийПрапорщиков);
	//Запрос.УстановитьПараметр("Солдаты",			СписокСолдатскихЗваний);
	//Запрос.УстановитьПараметр("Военнообязанный",	Перечисления.ОтношениеКВоинскойОбязанности.Военнообязанный);
	//Запрос.УстановитьПараметр("СписокГодныеКСлужбе",СписокГодныеКСлужбе);
	//Запрос.УстановитьПараметр("До30лет",			ДобавитьМесяц(ДатаАктуальности, -12*30));
	//Запрос.УстановитьПараметр("До35лет",			ДобавитьМесяц(ДатаАктуальности, -12*35));
	//Запрос.УстановитьПараметр("До40лет",			ДобавитьМесяц(ДатаАктуальности, -12*40));
	//Запрос.УстановитьПараметр("До45лет",			ДобавитьМесяц(ДатаАктуальности, -12*45));
	//Запрос.УстановитьПараметр("До50лет",			ДобавитьМесяц(ДатаАктуальности, -12*50));
	//Запрос.УстановитьПараметр("Призывник",			Перечисления.ОтношениеКВоинскойОбязанности.Призывник);
	//Запрос.УстановитьПараметр("Руководители",		Перечисления.КатегорииДолжностейДляВоинскогоУчета.Руководители);
	//Запрос.УстановитьПараметр("Специалисты",		Перечисления.КатегорииДолжностейДляВоинскогоУчета.СпециалистыСХ);
	//Запрос.УстановитьПараметр("ДругиеСлужащие",		Перечисления.КатегорииДолжностейДляВоинскогоУчета.ДругиеСлужащие);
	//Запрос.УстановитьПараметр("Рабочие",			Перечисления.КатегорииДолжностейДляВоинскогоУчета.РабочиеСХ);
	//Запрос.УстановитьПараметр("ПустаяКатегорияВоинскогоУчета", Перечисления.КатегорииДолжностейДляВоинскогоУчета.ПустаяСсылка());
	//Запрос.УстановитьПараметр("ВнутреннееСовместительство", Перечисления.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство);
	
	Результат.Очистить();
	//Макет 			= ПолучитьМакет("Форма6");
	//ОбластьШапка 	= Макет.ПолучитьОбласть("ШапкаФормы6");
	//ОбластьШапка.Параметры.ГодОтчета			= "за " +Формат(ДатаАктуальности, "ДФ=гггг") + " год";
	//ОбластьШапка.Параметры.НазваниеОрганизации 	= Организация.Наименование;
	//ДокументРезультат.Присоединить(ОбластьШапка);
	
	ТДанных = Новый ТаблицаЗначений;
	ТДанных.Колонки.Добавить("НомерСтрокиОтчета", ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(10));
	ТДанных.Колонки.Добавить("Порядок", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(2));
	ТДанных.Колонки.Добавить("ИмяСтрокиОтчета", ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(100));
	ТДанных.Колонки.Добавить("Категория");
	
	//Категории = Перечисления.КатегорииДолжностейДляВоинскогоУчета;
	//// список всех категорий срециалистов
	//СпВсеСпециалисты = Новый СписокЗначений;
	//СпВсеСпециалисты.Добавить(Категории.ПрочиеСпециалисты);
	//СпВсеСпециалисты.Добавить(Категории.СпециалистыСХ);
	//СпВсеСпециалисты.Добавить(Категории.СпециалистыТорговлиИОбщепита);
	//СпВсеСпециалисты.Добавить(Категории.СпециалистыНауки);
	//СпВсеСпециалисты.Добавить(Категории.СпециалистыКультуры);
	//СпВсеСпециалисты.Добавить(Категории.СпециалистыОбразования);
	//СпВсеСпециалисты.Добавить(Категории.Врачи);
	//СпВсеСпециалисты.Добавить(Категории.СреднийМедицинскийПерсонал);
	//// Список специалистов здравоохранения
	//СпСпециалистыЗдравохранения = Новый СписокЗначений;
	//СпСпециалистыЗдравохранения.Добавить(Категории.Врачи);
	//СпСпециалистыЗдравохранения.Добавить(Категории.СреднийМедицинскийПерсонал);
	//// Список всех категорий рабочих
	//СпВсеРабочие = Новый СписокЗначений;
	//СпВсеРабочие.Добавить(Категории.ПрочиеРабочие);
	//СпВсеРабочие.Добавить(Категории.Рабочие1_2Разрядов);
	//СпВсеРабочие.Добавить(Категории.Рабочие3_4Разрядов);
	//СпВсеРабочие.Добавить(Категории.Рабочие5РазрядаИВыше);
	//СпВсеРабочие.Добавить(Категории.РабочиеНеИмеющиеТарифныхСтавок);
	//СпВсеРабочие.Добавить(Категории.РабочиеСХ);
	//СпВсеРабочие.Добавить(Категории.РабочиеЛокомотивныхБригад);
	//СпВсеРабочие.Добавить(Категории.Водители);
	//СпВсеРабочие.Добавить(Категории.Трактористы);
	
	Категории = Перечисления.КатегорииДолжностейДляВоинскогоУчета;
	
	ОписаниеСтрокиДанных(ТДанных, "1", 1, "Руководители", 		 Категории.Руководители);
	ОписаниеСтрокиДанных(ТДанных, "2", 2, "Специалисты - всего", Категории.ПрочиеСпециалисты);
	ОписаниеСтрокиДанных(ТДанных, "2", 2, "Специалисты - всего", Категории.СпециалистыСХ);
	ОписаниеСтрокиДанных(ТДанных, "2", 2, "Специалисты - всего", Категории.СпециалистыТорговлиИОбщепита);
	ОписаниеСтрокиДанных(ТДанных, "2", 2, "Специалисты - всего", Категории.СпециалистыНауки);
	ОписаниеСтрокиДанных(ТДанных, "2", 2, "Специалисты - всего", Категории.СпециалистыКультуры);
	ОписаниеСтрокиДанных(ТДанных, "2", 2, "Специалисты - всего", Категории.СпециалистыОбразования);
	ОписаниеСтрокиДанных(ТДанных, "2", 2, "Специалисты - всего", Категории.Врачи);
	ОписаниеСтрокиДанных(ТДанных, "2", 2, "Специалисты - всего", Категории.СреднийМедицинскийПерсонал);
	ОписаниеСтрокиДанных(ТДанных, "2", 2, "Специалисты - всего", Категории.ПрочиеСпециалисты);
	ОписаниеСтрокиДанных(ТДанных, "",   3,  "из них:", 							Неопределено);
	ОписаниеСтрокиДанных(ТДанных, "3",  4,  " - сельского хозяйства",			   Категории.СпециалистыСХ);
	ОписаниеСтрокиДанных(ТДанных, "4",  5,  " - торговли и общественного питания", Категории.СпециалистыТорговлиИОбщепита);
	ОписаниеСтрокиДанных(ТДанных, "5",  6,  " - науки", 							Категории.СпециалистыНауки);
	ОписаниеСтрокиДанных(ТДанных, "6",  7,  " - культуры и искусства", 				Категории.СпециалистыКультуры);
	ОписаниеСтрокиДанных(ТДанных, "7",  8,	" - образования", 						Категории.СпециалистыОбразования);
	ОписаниеСтрокиДанных(ТДанных, "8",  9,	" - здравохранения - всего", 			Категории.Врачи);
	ОписаниеСтрокиДанных(ТДанных, "8",  9,	" - здравохранения - всего", 			Категории.СреднийМедицинскийПерсонал);
	ОписаниеСтрокиДанных(ТДанных, "",   10, "в том числе:", 						Неопределено);
	ОписаниеСтрокиДанных(ТДанных, "9",  11, " - врачи", 							Категории.Врачи);
	ОписаниеСтрокиДанных(ТДанных, "10", 12,	" - средний медицинский персонал", 		Категории.СреднийМедицинскийПерсонал);
	ОписаниеСтрокиДанных(ТДанных, "11", 13,	"Другие служащие", 						Категории.ДругиеСлужащие);
	ОписаниеСтрокиДанных(ТДанных, "12", 14,	"Рабочие всего", 						Категории.Рабочие1_2Разрядов);
	ОписаниеСтрокиДанных(ТДанных, "12", 14,	"Рабочие всего", 						Категории.Рабочие3_4Разрядов);
	ОписаниеСтрокиДанных(ТДанных, "12", 14,	"Рабочие всего", 						Категории.Рабочие5РазрядаИВыше);
	ОписаниеСтрокиДанных(ТДанных, "12", 14,	"Рабочие всего", 						Категории.РабочиеНеИмеющиеТарифныхСтавок);
	ОписаниеСтрокиДанных(ТДанных, "12", 14,	"Рабочие всего", 						Категории.РабочиеСХ);
	ОписаниеСтрокиДанных(ТДанных, "12", 14,	"Рабочие всего", 						Категории.РабочиеЛокомотивныхБригад);
	ОписаниеСтрокиДанных(ТДанных, "12", 14,	"Рабочие всего", 						Категории.Водители);
	ОписаниеСтрокиДанных(ТДанных, "12", 14,	"Рабочие всего", 						Категории.Трактористы);
	ОписаниеСтрокиДанных(ТДанных, "12", 14,	"Рабочие всего", 						Категории.ПрочиеРабочие);
	ОписаниеСтрокиДанных(ТДанных, "  ", 15, "в том числе:", 						Неопределено);
	ОписаниеСтрокиДанных(ТДанных, "13", 16, " - 1-2 разрядов", 						Категории.Рабочие1_2Разрядов);
	ОписаниеСтрокиДанных(ТДанных, "14", 17,	" - 3-4 разрядов", 						Категории.Рабочие3_4Разрядов);
	ОписаниеСтрокиДанных(ТДанных, "15", 18,	" - 5-го разряда и выше", 				Категории.Рабочие5РазрядаИВыше);
	ОписаниеСтрокиДанных(ТДанных, "16", 19,	" - не имеющие тарифных разрядов",		Категории.РабочиеНеИмеющиеТарифныхСтавок);
	ОписаниеСтрокиДанных(ТДанных, "17",	20, " - сельскохозяйственного производства",Категории.РабочиеСХ);
	ОписаниеСтрокиДанных(ТДанных, "18",	21, " - локомотивных бригад", 				Категории.РабочиеЛокомотивныхБригад);
	ОписаниеСтрокиДанных(ТДанных, "19",	22, " - водители", 							Категории.Водители);
	ОписаниеСтрокиДанных(ТДанных, "20", 23, " - трактористы",						Категории.Трактористы);
	ОписаниеСтрокиДанных(ТДанных, "  ",	24, "Из численности руководителей,",		Неопределено);
	ОписаниеСтрокиДанных(ТДанных, "  ",	25, "специалистов и рабочих:",				Неопределено);
	ОписаниеСтрокиДанных(ТДанных, "21",	26, " - летно-подъемный состав",			Неопределено);
	ОписаниеСтрокиДанных(ТДанных, "22",	27, " - плавающий состав",					Неопределено);
	ОписаниеСтрокиДанных(ТДанных, "23",	28, "Учащиеся",								Категории.Учащиеся);
	ОписаниеСтрокиДанных(ТДанных, "24", 29, "ИТОГО (сумма строк 1+2+11+12+23)",   Категории.Руководители);
	ОписаниеСтрокиДанных(ТДанных, "24", 29, "ИТОГО (сумма строк 1+2+11+12+23)",   Категории.ПрочиеСпециалисты);
	ОписаниеСтрокиДанных(ТДанных, "24", 29, "ИТОГО (сумма строк 1+2+11+12+23)",   Категории.СпециалистыСХ);
	ОписаниеСтрокиДанных(ТДанных, "24", 29, "ИТОГО (сумма строк 1+2+11+12+23)",   Категории.СпециалистыТорговлиИОбщепита);
	ОписаниеСтрокиДанных(ТДанных, "24", 29, "ИТОГО (сумма строк 1+2+11+12+23)",   Категории.СпециалистыНауки);
	ОписаниеСтрокиДанных(ТДанных, "24", 29, "ИТОГО (сумма строк 1+2+11+12+23)",   Категории.СпециалистыКультуры);
	ОписаниеСтрокиДанных(ТДанных, "24", 29, "ИТОГО (сумма строк 1+2+11+12+23)",   Категории.СпециалистыОбразования);
	ОписаниеСтрокиДанных(ТДанных, "24", 29, "ИТОГО (сумма строк 1+2+11+12+23)",   Категории.Врачи);
	ОписаниеСтрокиДанных(ТДанных, "24", 29, "ИТОГО (сумма строк 1+2+11+12+23)",   Категории.СреднийМедицинскийПерсонал);
	ОписаниеСтрокиДанных(ТДанных, "24", 29, "ИТОГО (сумма строк 1+2+11+12+23)",  Категории.СпециалистыСХ);
	ОписаниеСтрокиДанных(ТДанных, "24", 29, "ИТОГО (сумма строк 1+2+11+12+23)",  Категории.СпециалистыТорговлиИОбщепита);
	ОписаниеСтрокиДанных(ТДанных, "24", 29, "ИТОГО (сумма строк 1+2+11+12+23)", Категории.СпециалистыНауки);
	ОписаниеСтрокиДанных(ТДанных, "24", 29, "ИТОГО (сумма строк 1+2+11+12+23)", Категории.СпециалистыКультуры);
	ОписаниеСтрокиДанных(ТДанных, "24", 29,	"ИТОГО (сумма строк 1+2+11+12+23)", Категории.СпециалистыОбразования);
	ОписаниеСтрокиДанных(ТДанных, "24", 29,	"ИТОГО (сумма строк 1+2+11+12+23)", Категории.ПрочиеСпециалисты);
	ОписаниеСтрокиДанных(ТДанных, "24", 29,	"ИТОГО (сумма строк 1+2+11+12+23)", Категории.Врачи);
	ОписаниеСтрокиДанных(ТДанных, "24", 29,	"ИТОГО (сумма строк 1+2+11+12+23)", Категории.СреднийМедицинскийПерсонал);
	ОписаниеСтрокиДанных(ТДанных, "24", 29, "ИТОГО (сумма строк 1+2+11+12+23)", Категории.Врачи);
	ОписаниеСтрокиДанных(ТДанных, "24", 29,	"ИТОГО (сумма строк 1+2+11+12+23)", Категории.СреднийМедицинскийПерсонал);
	ОписаниеСтрокиДанных(ТДанных, "24", 29,	"ИТОГО (сумма строк 1+2+11+12+23)", Категории.ДругиеСлужащие);
	ОписаниеСтрокиДанных(ТДанных, "24", 29,	"ИТОГО (сумма строк 1+2+11+12+23)", Категории.Рабочие1_2Разрядов);
	ОписаниеСтрокиДанных(ТДанных, "24", 29,	"ИТОГО (сумма строк 1+2+11+12+23)", Категории.Рабочие3_4Разрядов);
	ОписаниеСтрокиДанных(ТДанных, "24", 29,	"ИТОГО (сумма строк 1+2+11+12+23)", Категории.Рабочие5РазрядаИВыше);
	ОписаниеСтрокиДанных(ТДанных, "24", 29,	"ИТОГО (сумма строк 1+2+11+12+23)", Категории.РабочиеНеИмеющиеТарифныхСтавок);
	ОписаниеСтрокиДанных(ТДанных, "24", 29,	"ИТОГО (сумма строк 1+2+11+12+23)", Категории.РабочиеСХ);
	ОписаниеСтрокиДанных(ТДанных, "24", 29,	"ИТОГО (сумма строк 1+2+11+12+23)", Категории.РабочиеЛокомотивныхБригад);
	ОписаниеСтрокиДанных(ТДанных, "24", 29,	"ИТОГО (сумма строк 1+2+11+12+23)", Категории.Водители);
	ОписаниеСтрокиДанных(ТДанных, "24", 29,	"ИТОГО (сумма строк 1+2+11+12+23)", Категории.Трактористы);
	ОписаниеСтрокиДанных(ТДанных, "24", 29,	"ИТОГО (сумма строк 1+2+11+12+23)", Категории.Рабочие1_2Разрядов);
	ОписаниеСтрокиДанных(ТДанных, "24", 29,	"ИТОГО (сумма строк 1+2+11+12+23)", Категории.Рабочие3_4Разрядов);
	ОписаниеСтрокиДанных(ТДанных, "24", 29,	"ИТОГО (сумма строк 1+2+11+12+23)", Категории.Рабочие5РазрядаИВыше);
	ОписаниеСтрокиДанных(ТДанных, "24", 29,	"ИТОГО (сумма строк 1+2+11+12+23)",	Категории.РабочиеНеИмеющиеТарифныхСтавок);
	ОписаниеСтрокиДанных(ТДанных, "24", 29,	"ИТОГО (сумма строк 1+2+11+12+23)",	Категории.ПрочиеРабочие);
	ОписаниеСтрокиДанных(ТДанных, "24",	29, "ИТОГО (сумма строк 1+2+11+12+23)", Категории.РабочиеСХ);
	ОписаниеСтрокиДанных(ТДанных, "24",	29, "ИТОГО (сумма строк 1+2+11+12+23)", Категории.РабочиеЛокомотивныхБригад);
	ОписаниеСтрокиДанных(ТДанных, "24",	29, "ИТОГО (сумма строк 1+2+11+12+23)", Категории.Водители);
	ОписаниеСтрокиДанных(ТДанных, "24", 29, "ИТОГО (сумма строк 1+2+11+12+23)",	Категории.Трактористы);
	ОписаниеСтрокиДанных(ТДанных, "24",	29, "ИТОГО (сумма строк 1+2+11+12+23)",	Категории.Учащиеся);
	ОписаниеСтрокиДанных(ТДанных, "25",	30, "По небронируемым организациям",		Неопределено);
	ОписаниеСтрокиДанных(ТДанных, "26", 31, "ВСЕГО (сумма строк 24+25)", Категории.Руководители);
	ОписаниеСтрокиДанных(ТДанных, "26", 31, "ВСЕГО (сумма строк 24+25)", Категории.ПрочиеСпециалисты);
	ОписаниеСтрокиДанных(ТДанных, "26", 31, "ВСЕГО (сумма строк 24+25)", Категории.СпециалистыСХ);
	ОписаниеСтрокиДанных(ТДанных, "26", 31, "ВСЕГО (сумма строк 24+25)", Категории.ПрочиеСпециалисты);
	ОписаниеСтрокиДанных(ТДанных, "26", 31, "ВСЕГО (сумма строк 24+25)", Категории.СпециалистыТорговлиИОбщепита);
	ОписаниеСтрокиДанных(ТДанных, "26", 31, "ВСЕГО (сумма строк 24+25)", Категории.СпециалистыНауки);
	ОписаниеСтрокиДанных(ТДанных, "26", 31, "ВСЕГО (сумма строк 24+25)", Категории.СпециалистыКультуры);
	ОписаниеСтрокиДанных(ТДанных, "26", 31, "ВСЕГО (сумма строк 24+25)", Категории.СпециалистыОбразования);
	ОписаниеСтрокиДанных(ТДанных, "26", 31, "ВСЕГО (сумма строк 24+25)", Категории.Врачи);
	ОписаниеСтрокиДанных(ТДанных, "26", 31, "ВСЕГО (сумма строк 24+25)", Категории.СреднийМедицинскийПерсонал);
	ОписаниеСтрокиДанных(ТДанных, "26", 31, "ВСЕГО (сумма строк 24+25)", Категории.СпециалистыСХ);
	ОписаниеСтрокиДанных(ТДанных, "26", 31, "ВСЕГО (сумма строк 24+25)", Категории.СпециалистыТорговлиИОбщепита);
	ОписаниеСтрокиДанных(ТДанных, "26", 31, "ВСЕГО (сумма строк 24+25)", Категории.СпециалистыНауки);
	ОписаниеСтрокиДанных(ТДанных, "26", 31, "ВСЕГО (сумма строк 24+25)", Категории.СпециалистыКультуры);
	ОписаниеСтрокиДанных(ТДанных, "26", 31,	"ВСЕГО (сумма строк 24+25)", Категории.СпециалистыОбразования);
	ОписаниеСтрокиДанных(ТДанных, "26", 31,	"ВСЕГО (сумма строк 24+25)", Категории.Врачи);
	ОписаниеСтрокиДанных(ТДанных, "26", 31,	"ВСЕГО (сумма строк 24+25)", Категории.СреднийМедицинскийПерсонал);
	ОписаниеСтрокиДанных(ТДанных, "26", 31, "ВСЕГО (сумма строк 24+25)", Категории.Врачи);
	ОписаниеСтрокиДанных(ТДанных, "26", 31,	"ВСЕГО (сумма строк 24+25)", Категории.СреднийМедицинскийПерсонал);
	ОписаниеСтрокиДанных(ТДанных, "26", 31,	"ВСЕГО (сумма строк 24+25)", Категории.ДругиеСлужащие);
	ОписаниеСтрокиДанных(ТДанных, "26", 31,	"ВСЕГО (сумма строк 24+25)", Категории.Рабочие1_2Разрядов);
	ОписаниеСтрокиДанных(ТДанных, "26", 31,	"ВСЕГО (сумма строк 24+25)", Категории.Рабочие3_4Разрядов);
	ОписаниеСтрокиДанных(ТДанных, "26", 31,	"ВСЕГО (сумма строк 24+25)", Категории.Рабочие5РазрядаИВыше);
	ОписаниеСтрокиДанных(ТДанных, "26", 31,	"ВСЕГО (сумма строк 24+25)", Категории.РабочиеНеИмеющиеТарифныхСтавок);
	ОписаниеСтрокиДанных(ТДанных, "26", 31,	"ВСЕГО (сумма строк 24+25)", Категории.РабочиеСХ);
	ОписаниеСтрокиДанных(ТДанных, "26", 31,	"ВСЕГО (сумма строк 24+25)", Категории.РабочиеЛокомотивныхБригад);
	ОписаниеСтрокиДанных(ТДанных, "26", 31,	"ВСЕГО (сумма строк 24+25)", Категории.Водители);
	ОписаниеСтрокиДанных(ТДанных, "26", 31,	"ВСЕГО (сумма строк 24+25)", Категории.Трактористы);
	ОписаниеСтрокиДанных(ТДанных, "26", 31,	"ВСЕГО (сумма строк 24+25)", Категории.Рабочие1_2Разрядов);
	ОписаниеСтрокиДанных(ТДанных, "26", 31,	"ВСЕГО (сумма строк 24+25)", Категории.Рабочие3_4Разрядов);
	ОписаниеСтрокиДанных(ТДанных, "26", 31,	"ВСЕГО (сумма строк 24+25)", Категории.Рабочие5РазрядаИВыше);
	ОписаниеСтрокиДанных(ТДанных, "26", 31,	"ВСЕГО (сумма строк 24+25)", Категории.РабочиеНеИмеющиеТарифныхСтавок);
	ОписаниеСтрокиДанных(ТДанных, "26", 31,	"ВСЕГО (сумма строк 24+25)", Категории.ПрочиеРабочие);
	ОписаниеСтрокиДанных(ТДанных, "26",	31, "ВСЕГО (сумма строк 24+25)", Категории.РабочиеСХ);
	ОписаниеСтрокиДанных(ТДанных, "26",	31, "ВСЕГО (сумма строк 24+25)", Категории.РабочиеЛокомотивныхБригад);
	ОписаниеСтрокиДанных(ТДанных, "26",	31, "ВСЕГО (сумма строк 24+25)", Категории.Водители);
	ОписаниеСтрокиДанных(ТДанных, "26", 31, "ВСЕГО (сумма строк 24+25)", Категории.Трактористы);
	ОписаниеСтрокиДанных(ТДанных, "26",	31, "ВСЕГО (сумма строк 24+25)", Категории.Учащиеся);
	
	СтруктураДанных = Новый Структура("СтрокиОтчета", ТДанных);
	
	ТиповыеОтчеты.СформироватьТиповойОтчет(ЭтотОбъект, Результат, , ВыводВФормуОтчета, СтруктураДанных);
	
	//Параметры документа
	Результат.Автомасштаб 			= Истина;
	Результат.ОриентацияСтраницы 	= ОриентацияСтраницы.Ландшафт;
	Результат.Защита              	= Ложь;
	КомпоновщикНастроек.ЗагрузитьНастройки(НастрокаПоУмолчанию);
	Возврат Результат;
		
КонецФункции

Процедура СохранитьНастройку() Экспорт

	СтруктураНастроек = ТиповыеОтчеты.ПолучитьСтруктуруПараметровТиповогоОтчета(ЭтотОбъект);
	СохранениеНастроек.СохранитьНастройкуОбъекта(СохраненнаяНастройка, СтруктураНастроек);
	
КонецПроцедуры

Процедура ПрименитьНастройку() Экспорт
	
	Схема = ТиповыеОтчеты.ПолучитьСхемуКомпоновкиОбъекта(ЭтотОбъект);

	// Считываение структуры настроек отчета
 	Если Не СохраненнаяНастройка.Пустая() Тогда
		
		СтруктураНастроек = СохраненнаяНастройка.ХранилищеНастроек.Получить();
		Если Не СтруктураНастроек = Неопределено Тогда
			КомпоновщикНастроек.ЗагрузитьНастройки(СтруктураНастроек.НастройкиКомпоновщика);
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураНастроек);
		Иначе
			КомпоновщикНастроек.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
		КонецЕсли;
		
	Иначе
		КомпоновщикНастроек.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
	КонецЕсли;

КонецПроцедуры

Процедура ПередВыводомЭлементРезультата(МакетКомпоновки, ПроцессорКомпоновки, ЭлементРезультата) Экспорт
	
КонецПроцедуры

Процедура ПередВыводомОтчета(МакетКомпоновки, ПроцессорКомпоновки) Экспорт
	
	
КонецПроцедуры

Процедура ПриВыводеЗаголовкаОтчета(ОбластьЗаголовок) Экспорт
КонецПроцедуры

Функция ПолучитьПараметрыИсполненияОтчета() Экспорт
	СписокПолейПодстановкиОтборовПоУмолчанию = Новый Соответствие;
	СписокПолейПодстановкиОтборовПоУмолчанию.Вставить("Организация", "ОсновнаяОрганизация");
	
	Возврат Новый Структура("ИспользоватьСобытияПриФормированииОтчета,
	|ПриВыводеЗаголовкаОтчета,
	|ПослеВыводаПанелиПользователя,
	|ПослеВыводаПериода,
	|ПослеВыводаПараметра,
	|ПослеВыводаГруппировки,
	|ПослеВыводаОтбора,
	|ДействияПанелиИзменениеФлажкаДопНастроек,
	|ПриПолучениеНастроекПользователя, 
	|ЗаполнитьОтборыПоУмолчанию, 
	|СписокПолейПодстановкиОтборовПоУмолчанию", 
	ложь, ложь, ложь, ложь, ложь, ложь, ложь, ложь, ложь, истина, СписокПолейПодстановкиОтборовПоУмолчанию);
КонецФункции

#Если Клиент Тогда
	
// Настройка отчета при отработки расшифровки
Процедура Настроить(Отбор) Экспорт
	
	// Настройка отбора
	Для каждого ЭлементОтбора Из Отбор Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			ПолеОтбора = ЭлементОтбора.ЛевоеЗначение;
		Иначе
			ПолеОтбора = Новый ПолеКомпоновкиДанных(ЭлементОтбора.Поле);
		КонецЕсли;
		
		Если КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(ПолеОтбора) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			ЗаполнитьЗначенияСвойств(НовыйЭлементОтбора, ЭлементОтбора);
		Иначе
			НовыйЭлементОтбора.Использование  = Истина;
			НовыйЭлементОтбора.ЛевоеЗначение  = ПолеОтбора;
			Если ЭлементОтбора.Иерархия Тогда
				Если ТипЗнч(ЭлементОтбора.Значение) = Тип("СписокЗначений") Тогда
					НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии;
				Иначе
					НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
				КонецЕсли;
			Иначе
				Если ТипЗнч(ЭлементОтбора.Значение) = Тип("СписокЗначений") Тогда
					НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
				Иначе
					НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				КонецЕсли;
			КонецЕсли;
			
			НовыйЭлементОтбора.ПравоеЗначение = ЭлементОтбора.Значение;
			
		КонецЕсли;
				
	КонецЦикла;
	
	ТиповыеОтчеты.УдалитьДублиОтбора(КомпоновщикНастроек);
	
КонецПроцедуры

#КонецЕсли

Процедура ДоработатьКомпоновщикПередВыводом() Экспорт
КонецПроцедуры



Если СохраненнаяНастройка = Неопределено Тогда
	СохраненнаяНастройка =  Справочники.СохраненныеНастройки.ПустаяСсылка();
КонецЕсли;

Если КомпоновщикНастроек = Неопределено Тогда
	КомпоновщикНастроек =  Новый КомпоновщикНастроекКомпоновкиДанных;
КонецЕсли;
УправлениеОтчетами.ЗаменитьНазваниеПолейСхемыКомпоновкиДанных(СхемаКомпоновкиДанных);
